setonix/applications/OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5940;
        startFace       258990;
    }
    cyclic_in
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          885;
        startFace       264930;
        matchTolerance  0.001;
        transform       unknown;
        neighbourPatch  cyclic_out;
    }
    cyclic_out
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          885;
        startFace       265815;
        matchTolerance  0.001;
        transform       unknown;
        neighbourPatch  cyclic_in;
    }
)

// ************************************************************************* //
