setonix/applications/OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/constant/postSpanwiseAverageDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postSpanwiseAverageDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Seed patches to start averaging from
patches (cyclic_in);

// Homogeneous direction in which to perform averaging
component z;

// Non-homogeneous directions
componentAlt1 x;
componentAlt2 y;

// ************************************************************************* //
