setonix/applications/OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    cyclic_in
    {
        type            cyclic;
    }

    cyclic_out
    {
        type            cyclic;
    }
   
    WALL
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
